package com.javasource.se.FollowTheWhiteRabbit.lesson26;

public class Description {
}




/*
charAt()              - метод принимает строки, возвращает символ
codePointAt()         - метод принимает строки, возвращает символ по кодировке юникод
compareTo()           - метод сравнивает строку с принимаемой строкой (вычитание символов)
compareToIgnoreCase() - тоже самое, но без учета регистра
concat()              - контактенация
equals()              - строка сравнивается с другим объектом на равенство (boolean)
equalsIgnoreCase()    - строка сравнивается с другим объектом на равенство (boolean) -без учета регистра
hashCode()            - возвращает хэш объекта
indexOf()             - метод принимает число в юникоде и ищет его в объекте. Если присутсвует - возвращает индекс. Если отсутствует, то -1
isEmpty()             - true, если строка пустая
length()              - возвращает длину строки
split()               - принимает какой-то разделитель и возвращает массив стрингов
substring(ind1, ind2) - обрезает строку между начальным и конечным индексом
toCharArray()         - метод принимает массив стрингу, возвращает массив по символам (строку разбиваем по символам)
toLowerCase()         - всю стрингу переводит в нижний регистр
toUpperCase()         - всю стрингу переводит в верхний регистр
trim()                - обрезает пробелы в начале, конце
*/